extends RefCounted

# TODO: Панель преференций проекта (например, файл локализаций, язык по-умолчанию)
# TODO: Кнопка для раскрытия текстового поля, в которое будет подтягиваться текст
# из файла локализаций.
# TODO: История действий
# TODO: Файл со списком персонажей (по факту файл локализаций). Должен быть какой-то отдельный файл со списком персов
# (да и вообще с какими-то базовыми данными)
# TODO: Список резервных тегов
# TODO: Нода "Emitter" для сигналов
# TODO: Предупреждать об обновлении версии дупы перед сохранением таймлайна, который был создан в предыдущей версии

# TODO: Режим проверки диалога прямо в плагине, возможность запуска из любой точки.
# Просьба ввести значение некой переменной, если она не будет задана после запуска из рандомной
# точки или даже из начала (просто во время диалога выскакивает панелька с просьбой?)

# TODO: В далёком будущем: юнит-тесты для файлов локализаций.
