extends RefCounted

# TODO: Панель создать/открыть файл
# TODO: Панель преференций проекта (например, файл локализаций, язык по-умолчанию)
# TODO: Кнопка для раскрытия текстового поля, в которое будет подтягиваться текст
# из файла локализаций.
# TODO: История действий
# TODO: Файл со списком персонажей (по факту файл локализаций). Должен быть какой-то отдельный файл со списком персов
# (да и вообще с какими-то базовыми данными)
# TODO: Список резервных тегов

# TODO: В далёком будущем: юнит-тесты для файлов локализаций.
